In [2]:
import pandas as pd

In [6]:
df1=pd.DataFrame({'ID':[1,2,3,4],
                'Class':[9,10,11,12]})

In [7]:
df2=pd.DataFrame({'ID':[1,2,3,4],
                'Name':['A','B','C','D']})

In [10]:
pd.merge(df1,df2, on='ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [11]:
pd.merge(df2,df1, on='ID')

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11
3   4    D     12

In [14]:
df3=pd.DataFrame({'ID':[1,2,3,5],
                'Name':['A','B','C','D']})

In [15]:
pd.merge(df1,df3,on='ID')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [16]:
pd.merge(df1,df3,on='ID',how='left')

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [17]:
pd.merge(df1,df3,on='ID',how='right')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5    NaN    D

In [18]:
pd.merge(df1,df3,on='ID',how='outer')

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4   12.0  NaN
4   5    NaN    D

In [20]:
pd.merge(df1,df3,on='ID',how='outer',indicator=True)

   ID  Class Name      _merge
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0    C        both
3   4   12.0  NaN   left_only
4   5    NaN    D  right_only

In [21]:
pd.merge(df1,df3,on='ID',how='outer',indicator=False)

   ID  Class Name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4   12.0  NaN
4   5    NaN    D

In [3]:
df4=pd.DataFrame({'ID':[5,6,7,8],
                'Name':['A','B','C','D']})
df1=pd.DataFrame({'ID':[1,2,3,4],
                'Class':[9,10,11,12]})

In [23]:
pd.merge(df1,df4)

Empty DataFrame
Columns: [ID, Class, Name]
Index: []

In [24]:
pd.merge(df1,df4,left_index=True, right_index=True)

   ID_x  Class  ID_y Name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

In [25]:
pd.merge(df1,df4,left_index=False, right_index=False)

Empty DataFrame
Columns: [ID, Class, Name]
Index: []

In [26]:
df5=pd.DataFrame({'ID':[1,2,3,4],
                'Class':[9,10,11,12]})

In [27]:
df1= pd.DataFrame({'ID':[1,2,3,4],
                'Class':[9,10,11,12]})

In [28]:
pd.merge(df1,df5,on='ID')

   ID  Class_x  Class_y
0   1        9        9
1   2       10       10
2   3       11       11
3   4       12       12

In [29]:
pd.merge(df1,df5,on='ID',suffixes=['Higher','Lower'])

   ID  ClassHigher  ClassLower
0   1            9           9
1   2           10          10
2   3           11          11
3   4           12          12

In [31]:
pd.merge(df1,df5,on='Class',suffixes=('1','2'))

   ID1  Class  ID2
0    1      9    1
1    2     10    2
2    3     11    3
3    4     12    4